In [1]:
import pandas as pd

In [4]:
# Q1->
a = [4,8,15,16,23,42]
ans = pd.Series(a)

In [5]:
ans

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [9]:
# Q2->
li = [15,515,48,56,51,84,69,84,66,87]
Ser = pd.Series(li)
print(Ser)

0     15
1    515
2     48
3     56
4     51
5     84
6     69
7     84
8     66
9     87
dtype: int64

In [10]:
# Q3->
data = {'Name': ['Alice','Bob','Claire'], 'Age': [25,30,27], 'Gender': ['Female','Male','Female']}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
type(df)

pandas.core.frame.DataFrame

 Q4->
 The pandas DataFrame is a structure that contains two-dimensional data 
 and its corresponding labels.
 
 Pandas series is 1-D list with diaplay of indexes which is Size-immutable â€“ Once created, the size 
of a Series object cannot be changed and it should contain all values of same datatypes

while dataframe is 2 -D Array type structure which is mutable and can contain diffrent datatypes

 Q5->
 * some common functions you can use to manipulate data in a Pandas DataFrame
1. drop column
2. drop row
3. renaming column
4. slicing
5. selecting particular dtype


we use this manipulation to make our dataset more usefull
and know only particular info

Q6 ->
* Series are not mutable
* DataFrame is mutable
* In Panel Data and size are mutable.

In [20]:
# Q7->
courses = pd.Series(["Django","Flask","Hadoop"],name = 'courses')
fees = pd.Series([2200,1200,2300],name = 'fees')
time_in_months = pd.Series([3,1,4],name = 'time')

df1 = pd.concat([courses,fees,time_in_months],axis = 1)

In [21]:
df1

  courses  fees  time
0  Django  2200     3
1   Flask  1200     1
2  Hadoop  2300     4